public_html/org_roam_publish.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-roam publish</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">org-roam publish</h1>
<p>
Nuestra base de conocimiento en <a href="org_roam.html#ID-80ce4bf8-3936-45bf-adc9-041795828500">org-roam</a> se puede consultar en local gracias a <a href="https://github.com/org-roam/org-roam-ui">org-roam-ui</a>. Ahora vamos a dar un paso más y emplearemos las instrucciones de <a href="https://github.com/ikoamu/publish-org-roam-ui/tree/main">Ikoamu</a> para generar una web estática gracias a <a href="https://docs.github.com/es/actions">Github Actions</a>. Estos son los pasos a seguir.
</p>

<ul class="org-ul">
<li>Crear un repositorio en <a href="https://www.github.com">Github</a></li>
<li>Clonarlo a nuestro equipo donde usamos <a href="emacs.html#ID-c6e7e0fc-cb04-4a4d-beb3-1936f0d3aa07">emacs</a> y <a href="org_roam.html#ID-80ce4bf8-3936-45bf-adc9-041795828500">org-roam</a></li>
<li><p>
Copiamos la estructura del repo de <a href="https://github.com/ikoamu/publish-org-roam-ui/tree/main">Ikoamu</a> de forma que quede la estructura como la siguiente
</p>
<div class="org-src-container">
<pre class="src src-txt">├── action.yml
├── create_notes.sh
├── generate_json.js
├── generate_searchdata.mjs
├── LICENSE
├── org-files
│   ├── archivo1.org
│   ├── archivo2.org
│   ├── archivo3.org
├── package.json
└── package-lock.json
</pre>
</div></li>
<li><p>
Añadimos a la configuración de emacs las siguientes líneas.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(setq org-roam-directory <span style="color: #95e454;">"/path/to/org-roam-dir"</span>)
(setq org-roam-db-location <span style="color: #95e454;">"/path/to/org-roam-dir/org-files/org-roam.db"</span>)
</pre>
</div></li>
<li><p>
Dentro de la carpeta ".github/workflows" creamos el archivo "gh-pages.yml"
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">name</span>: Generate static org-roam-ui page
<span style="color: #e5786d;">on</span>:
  <span style="color: #cae682;">push</span>:
    <span style="color: #cae682;">branches</span>:
      - main
<span style="color: #cae682;">permissions</span>:
  <span style="color: #cae682;">contents</span>: read
  <span style="color: #cae682;">pages</span>: write
  <span style="color: #cae682;">id-token</span>: write

<span style="color: #cae682;">jobs</span>:
  <span style="color: #cae682;">main</span>:
    <span style="color: #cae682;">runs-on</span>: ubuntu-latest
    <span style="color: #cae682;">steps</span>:
      - <span style="color: #cae682;">name</span>: Generate org-roam-ui page
        <span style="color: #cae682;">uses</span>: ikoamu/org-roam-ui-hosting@main
        <span style="color: #cae682;">with</span>:
          <span style="color: #cae682;">org-roam-db-filename</span>: org-roam.db
          <span style="color: #cae682;">deploy-to-pages</span>: <span style="color: #e5786d;">true</span>
          <span style="color: #cae682;">org-roam-directory</span>: org-files
          <span style="color: #cae682;">site-title</span>: My Brain
</pre>
</div>

<blockquote>
<p>
Según hemos definido el archivo de configuración, tanto los archivos "*.org" como la base de datos "org-roam.db" estarán ubicados en el subdirectorio "org-files" y el título de la web será "My Brain"
</p>
</blockquote></li>

<li>Actualizamos los cambios del repositorio</li>
<li>Accedemos a la página de nuestro repositorio en Github</li>
<li>Accedemos al menú "Settings-Pages"</li>
<li>En "Build and deployment" seleccionamos "Github Actions"</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-06-11</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
